app/Controllers/RhController.php

SELECT *
FROM `departements`
---
    public function index()
    {
        $demandes = $this->demandeModel->getPending();
        $departements = $this->departementModel->findAll();