app/Models/DemandeCongeModel.php

SELECT `demandes_conge`.*, `types_conge`.`nom` as `type_conge`
FROM `demandes_conge`
JOIN `types_conge` ON `types_conge`.`id` = `demandes_conge`.`type_conge_id`
WHERE `demandes_conge`.`employe_id` = 5
ORDER BY `demandes_conge`.`created_at` DESC
---
    public function getByEmploye($employe_id)
    {
        return $this->select('demandes_conge.*, types_conge.nom as type_conge')
                    ->join('types_conge', 'types_conge.id = demandes_conge.type_conge_id')
                    ->where('demandes_conge.employe_id', $employe_id)
                    ->orderBy('demandes_conge.created_at', 'DESC')
                    ->findAll();

SELECT `demandes_conge`.*, `employes`.`nom` as `employe_nom`, `employes`.`departement_id`, `departements`.`nom` as `departement_nom`, `types_conge`.`nom` as `type_conge`
FROM `demandes_conge`
JOIN `employes` ON `employes`.`id` = `demandes_conge`.`employe_id`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
JOIN `types_conge` ON `types_conge`.`id` = `demandes_conge`.`type_conge_id`
WHERE `demandes_conge`.`statut` = 'en_attente'
ORDER BY `demandes_conge`.`created_at` ASC
---
    public function getPending()
    {
        return $this->select('demandes_conge.*, employes.nom as employe_nom, employes.departement_id,
                            departements.nom as departement_nom, types_conge.nom as type_conge')
                    ->join('employes', 'employes.id = demandes_conge.employe_id')
                    ->join('departements', 'departements.id = employes.departement_id', 'left')
                    ->join('types_conge', 'types_conge.id = demandes_conge.type_conge_id')
                    ->where('demandes_conge.statut', 'en_attente')
                    ->orderBy('demandes_conge.created_at', 'ASC')
                    ->findAll();

SELECT `demandes_conge`.*, `employes`.`nom` as `employe_nom`, `employes`.`departement_id`, `departements`.`nom` as `departement_nom`, `types_conge`.`nom` as `type_conge`
FROM `demandes_conge`
JOIN `employes` ON `employes`.`id` = `demandes_conge`.`employe_id`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
JOIN `types_conge` ON `types_conge`.`id` = `demandes_conge`.`type_conge_id`
WHERE `demandes_conge`.`statut` != 'en_attente'
ORDER BY `demandes_conge`.`updated_at` DESC
 LIMIT 1000
---
    public function getHistory($limit = 50)
    {
        return $this->select('demandes_conge.*, employes.nom as employe_nom, employes.departement_id,
                            departements.nom as departement_nom, types_conge.nom as type_conge')
                    ->join('employes', 'employes.id = demandes_conge.employe_id')
                    ->join('departements', 'departements.id = employes.departement_id', 'left')
                    ->join('types_conge', 'types_conge.id = demandes_conge.type_conge_id')
                    ->where('demandes_conge.statut !=', 'en_attente')
                    ->orderBy('demandes_conge.updated_at', 'DESC')
                    ->limit($limit)
                    ->findAll();