app/Models/EmployeModel.php

SELECT *
FROM `employes`
WHERE `email` = 'rh@techmada.mg'
AND `actif` = 1
 LIMIT 1
---
    public function getByEmail($email)
    {
        return $this->where('email', $email)
                    ->where('actif', 1)
                    ->first();

SELECT *
FROM `employes`
WHERE `actif` = 1
ORDER BY `nom` ASC
---
    public function getActive()
    {
        return $this->where('actif', 1)
                    ->orderBy('nom', 'ASC')
                    ->findAll();

SELECT `employes`.*, `departements`.`nom` as `departement_nom`
FROM `employes`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
WHERE `employes`.`id` = 2
 LIMIT 1
---
    public function getWithDept($id)
    {
        return $this->select('employes.*, departements.nom as departement_nom')
                    ->join('departements', 'departements.id = employes.departement_id', 'left')
                    ->where('employes.id', $id)
                    ->first();