app/Models/SoldeCongeModel.php

    public function getByEmployeAndYear($employe_id, $year)
    {
        return $this->select('soldes_conge.*, types_conge.nom as type_conge, types_conge.jours_max')
                    ->join('types_conge', 'types_conge.id = soldes_conge.type_conge_id')
                    ->where('soldes_conge.employe_id', $employe_id)
                    ->where('soldes_conge.annee', $year)
                    ->findAll();
---
SELECT `soldes_conge`.*, `types_conge`.`nom` as `type_conge`, `types_conge`.`jours_max`
FROM `soldes_conge`
JOIN `types_conge` ON `types_conge`.`id` = `soldes_conge`.`type_conge_id`
WHERE `soldes_conge`.`employe_id` = 5
AND `soldes_conge`.`annee` = '2026'